#Задачи: 
#1) Дан массив A, заполненный числами от 0 до n - 1 (числа вразброс). Дубликатов нет, 
#и есть одно потерянное значение. Надо его найти. // const array = [3, 6, 1, 4, 2, 5, 7, 8, 10, 11] !!! - ЗДЕСЬ НЕТ ЗНАЧЕНИЯ "0"

#Для того чтобы найти потерянное число в массиве от 0 до n - 1, можно использовать математическое 
#свойство суммы арифметической прогрессии. Сумма всех чисел от 0 до n - 1 вычисляется по формуле:
#сложить первое и последнее числа, разделитьих на два и умножить на N (количество чисел)

#𝑆=((A_1 + A_n)/2)×N
 
#Мы можем найти сумму всех элементов массива и вычесть её из суммы прогрессии, чтобы получить потерянное число.

def find_missing_number(arr):
    n = len(arr) + 1  # Длина должна быть на 1 больше из-за потерянного числа
    total_sum = n * (n - 1) // 2  # Сумма чисел от 0 до n-1
    actual_sum = sum(arr)  # Сумма элементов в массиве
    return total_sum - actual_sum  # Потерянное число

# Пример
array = [0, 3, 6, 1, 4, 2, 5, 7, 8, 10, 11] # добавили значение "0"
missing_number = find_missing_number(array)
print(f"Потерянное число: {missing_number}") # это число 9

# 2) Дан интерфейс калькулятора с простейшими арифметическими операциями - сложение, вычитание, умножение, деление.
# Выберите типы аргументов и результата операций, напишите реализацию интерфейса и покройте его unit-тестами.
# (p.s сразу подумать о проверке типа аргументов и чтобы не пропускал 0 в операцию деления в знаменатель)

